### Get started with _DataFrame_ !

#### Section 2.1

In [6]:
# example 1

import pandas as pd

record1 = pd.Series({'Name': 'Alice',
                     'Class': 'Physics',
                     'Score': 85})

record2 = pd.Series({'Name': 'Jack',
                     'Class': 'Chemistry',
                     'Score': 82})

record3 = pd.Series({'Name': 'Helen',
                     'Class': 'Biology',
                     'Score': 90})

df = pd.DataFrame([record1, record2, record3],
                  index=['school1', 'school2', 'school3'])

df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [10]:
# example 2

students = [{'Name': 'Alice',
             'Class': 'Physics',
             'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]

df = pd.DataFrame(students, index=['school1', 'school2', 'school3'])

df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [11]:
# example 3

df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [12]:
type(df.loc['school2'])

pandas.core.series.Series

In [15]:
# example 4

df.loc['school1', 'Name']

'Alice'

In [19]:
# example 5

# T ---> transope the matrix.
# This pivots all of the rows into columns and all of the columns into rows, and is done with the T attribute.

df.T

       school1    school2  school3
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [20]:
# example 6

df['Name']

school1    Alice
school2     Jack
school3    Helen
Name: Name, dtype: object

In [21]:
df.loc['school1']['Name']

'Alice'

In [25]:
# example 7

# We ask for all the names and scores for all schools using the .loc operator.
df.loc[:,['Name', 'Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school3  Helen     90

In [30]:
# example 8

# The drop function doesn't change the DataFrame by default !
# Instead the drop function returns to you a copy of the DataFrame with the given rows removed.

df.drop('school1')

          Name      Class  Score
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [31]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [32]:
# example 9

copy_df = df.copy()

copy_df.drop('Name', inplace=True, axis=1)

copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school3    Biology     90

In [33]:
del copy_df['Class']

copy_df

         Score
school1     85
school2     82
school3     90

In [38]:
# example 10

# Adding a new column to the DataFrame.

df['ClassRanking'] = None

df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school3  Helen    Biology     90         None